10/data/attachments/c8ebf761a4ff0a41.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_74bf323d-e197-4daa-af3b-fd4e71150586</nif:username>
            <nif:friendToBeAdded>Anna_child_Actions_70099_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>